app/Http/Controllers/AudioController.php

    public function index()
    {
        if(Auth::check())
        {
            if(Auth::user()->usertype!="Admin" AND Auth::user()->usertype!="Sub_Admin")
           {
              if(user_device_limit_reached(Auth::user()->id,Auth::user()->plan_id))
              {
                  return redirect('dashboard');
              }
           }
        }

        $slider = Slider::where('status',1)->whereRaw("find_in_set('Audio',slider_display_on)")->orderby('id','DESC')->get();
---
select * from `slider` where `status` = 1 and find_in_set('Audio',slider_display_on) order by `id` desc

        }
        else
        {
            $audios_list = Audio::where('is_active', true)->orderBy('created_at','DESC')->paginate($pagination_limit);
        }

        $genres = Audio::where('is_active', true)->distinct()->pluck('genre')->filter();
---
select * from `audio` where `is_active` = 1 order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `audio` where `is_active` = 1
select distinct `genre` from `audio` where `is_active` = 1