app/Http/Controllers/IndexController.php

    public function index()
    {

        if (!$this->alreadyInstalled()) {
            return redirect('public/install');
        }
        $random_movie = Movies::where('status', 1)->inRandomOrder()->first();
        $slider = Slider::where('status', 1)->whereRaw("find_in_set('Home',slider_display_on)")->orderby('id', 'DESC')->get();

        if (Auth::check()) {
            $current_user_id = Auth::User()->id;

            if (getcong('menu_movies') == 0 and getcong('menu_shows') == 0) {
                $recently_watched = RecentlyWatched::where('user_id', $current_user_id)->where('video_type', '!=', 'Movies')->where('video_type', '!=', 'Episodes')->orderby('id', 'DESC')->get();
            } else if (getcong('menu_sports') == 0 and getcong('menu_livetv') == 0) {
                $recently_watched = RecentlyWatched::where('user_id', $current_user_id)->where('video_type', '!=', 'Sports')->where('video_type', '!=', 'LiveTV')->orderby('id', 'DESC')->get();
            } else if (getcong('menu_livetv') == 0) {
                $recently_watched = RecentlyWatched::where('user_id', $current_user_id)->where('video_type', '!=', 'LiveTV')->orderby('id', 'DESC')->get();
---
select * from `slider` where `status` = 1 and find_in_set('Home',slider_display_on) order by `id` desc
select * from `recently_watched` where `user_id` = 1 and `video_type` != 'LiveTV' order by `id` desc

        }

        $upcoming_movies = Movies::where('upcoming', 1)->orderby('id', 'DESC')->get();
        $upcoming_series = Series::where('upcoming', 1)->orderby('id', 'DESC')->get();
---
select * from `series` where `upcoming` = 1 order by `id` desc

        if (Auth::check()) {
            try {
                // Fetch the like record if the user is authenticated
                $user_has_liked = Like::where('movie_video_id', $movies_info->id)
                    ->where('user_id', Auth::id())
                    ->first();
---
select * from `likes` where `movie_video_id` = 194 and `user_id` = 1 limit 1

            $movies_list = Movies::where('status', 1)->where('upcoming', 0)->orderBy('id', 'DESC')->paginate($pagination_limit);
        }

        $genres = Genres::where('status', 1)->orderBy('id', 'ASC')->get();
        // dd($Genres);
        $home_sections = HomeSections::where('status', 1)->orderby('id')->get();
---
select * from `genres` where `status` = 1 order by `id` asc
select * from `home_sections` where `status` = 1 order by `id` asc