app/Http/Controllers/PhotosController.php

    public function index()
    {
        if(Auth::check())
        {
            if(Auth::user()->usertype!="Admin" AND Auth::user()->usertype!="Sub_Admin")
           {
              if(user_device_limit_reached(Auth::user()->id,Auth::user()->plan_id))
              {
                  return redirect('dashboard');
              }
           }
        }

        $slider = Slider::where('status',1)->whereRaw("find_in_set('Photos',slider_display_on)")->orderby('id','DESC')->get();
---
select * from `slider` where `status` = 1 and find_in_set('Photos',slider_display_on) order by `id` desc

        }
        else
        {
            $photos_list = Photos::where('status','active')->orderBy('created_at','DESC')->paginate($pagination_limit);
        }

        $categories = Photos::where('status','active')->distinct()->pluck('category')->filter();
---
select * from `photos` where `status` = 'active' order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `photos` where `status` = 'active'
select distinct `category` from `photos` where `status` = 'active'