app/Http/Controllers/Admin/AudioController.php

select * from `audio` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `audio`
---
    public function index(Request $request)
    {
        $query = Audio::query();

        // Search functionality
        if ($request->has('s') && !empty($request->s)) {
            $search = $request->s;
            $query->where('title', 'like', "%{$search}%")
                  ->orWhere('description', 'like', "%{$search}%");
        }

        $audios = $query->orderBy('created_at', 'desc')->paginate(20);

select * from `audio` where `audio`.`id` = '12' limit 1
---
    public function edit(string $id)
    {
        $audio = Audio::findOrFail($id);

select * from `audio` where `audio`.`id` = '12' limit 1
---
    public function update(Request $request, string $id)
    {
        $audio = Audio::findOrFail($id);

update `audio` set `audio_path` = 'audio/1759165893_Can We Use 100 of our Brain..mp3', `audio`.`updated_at` = '2025-09-29 18:11:33' where `id` = 12
---
            $audio->setAttribute('audio_path', $path);
        }

        $audio->save();