app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `language`
select count(*) as aggregate from `genres`
select count(*) as aggregate from `series`
select count(*) as aggregate from `users` where `usertype` = 'sub_admin' and `users`.`deleted_at` is null
select count(*) as aggregate from `subscription_plan`
select count(*) as aggregate from `transaction`
select sum(`payment_amount`) as aggregate from `transaction` where `date` between 1759100400 and 1759186799
select sum(`payment_amount`) as aggregate from `transaction` where `date` between 1759100400 and 1759532400
select sum(`payment_amount`) as aggregate from `transaction` where `date` between 1756681200 and 1759186800
---
    public function index()
    {
            if(Auth::User()->usertype!="Admin" AND Auth::User()->usertype!="Sub_Admin")
            {

                \Session::flash('flash_message', 'Access denied!');

                return redirect('dashboard');

             }


    	    $language = Language::count();
            $genres = Genres::count();
            $movies = Movies::count();
            $series = Series::count();
            $sports = Sports::count();
            $livetv = LiveTV::count();
            $users = User::where('usertype','sub_admin')->count();
            $plan = SubscriptionPlan::count();
            $transactions = Transactions::count();

            //Revenue
            $start_day = date('Y-m-d 00:00:00');
            $finish_day = date('Y-m-d 23:59:59');
            $daily_amount= Transactions::whereBetween('date', array(strtotime($start_day), strtotime($finish_day)))->sum('payment_amount');

            $start_week = (date('D') != 'Mon') ? date('Y-m-d', strtotime('last Monday')) : date('Y-m-d');
            $finish_week = (date('D') != 'Sat') ? date('Y-m-d', strtotime('next Saturday')) : date('Y-m-d');
            $weekly_amount= Transactions::whereBetween('date', array(strtotime($start_week), strtotime($finish_week)))->sum('payment_amount');

            $start_month = date('Y-m-d', strtotime('first day of this month'));
            $finish_month = date('Y-m-d', strtotime('last day of this month'));
            $monthly_amount = Transactions::whereBetween('date', array(strtotime($start_month), strtotime($finish_month)))->sum('payment_amount');

select sum(`payment_amount`) as aggregate from `transaction` where `date` between 1735689600 and 1767139200
select * from `subscription_plan` order by `id` asc
---
            $current_year = date('Y');
            $start_day_year = "January 1st, {$current_year}";
            $end_day_year = "December 31st, {$current_year}";
            $yearly_amount = Transactions::whereBetween('date', array(strtotime($start_day_year), strtotime($end_day_year)))->sum('payment_amount');

            $plan_list = SubscriptionPlan::orderBy('id')->get();